IDEA StatiCa Open Model
Wall Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The Wall type exposes the following members.
Properties
Name | Description
EccentricityZ
 Displacement in local axis Z
 (Inherited from Element2D.)
Edges
 Lines of Element2D including edges, which are created by opening
ElementType
 Analysis type - shell, plate, wall
 (Inherited from Element2D.)
GeometricRegion
 Geometry region of element2D
 (Inherited from Element2D.)
GeomId
 Id representing geometrical parts of Detail
Id
 Element Id
 (Inherited from OpenElementId.)
InnerLines
 Inner lines of this region
 (Inherited from Element2D.)
InnerPoints
 Inner points of this region
 (Inherited from Element2D.)
InsertPoint
 Insert point 0 - 9
MasterComponent
 Master component
MasterPoint
 Master point 0 - 9
Material
 Material
 (Inherited from Element2D.)
Name
 Name
Position
 Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
Thickness
 Thicknes of Element2D
 (Inherited from Element2D.)
Top
See Also
Reference
Wall Class
IdeaRS.OpenModel.Detail Namespace